#### 데이터프레임

판다스에서 데이터(테이블 형태 - DB, 엑셀, csv)를 처리하는 가장 기본이 되는 자료구조

<img src="https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F99FD8D385BFBECE32D" width="500">

##### 데이터프레임 생성
```python
pd.DataFrame(...)
```

In [102]:
# 판다스, 넘파이 import
import pandas as pd
import numpy as np

In [103]:
datas = {
    '이름': ['길동이', '길순이', '유고',  '애슐리'],
    '국어': [80, 100, 10, 90],
    '영어': [50, 100, 99, 100],
    '수학': [90, 100, 10, 50],
    '미술': [100, 100, 99, 30]
} # 기본데이터, 실제로는 excel, csv, db, openAPI에서 받아와서 처리

df1 = pd.DataFrame(datas)
df1

    이름   국어   영어   수학   미술
0  길동이   80   50   90  100
1  길순이  100  100  100  100
2   유고   10   99   10   99
3  애슐리   90  100   50   30

##### 특정컬럼 사용

In [104]:
# 특정컬럼 만으로 데이터프레임을 생성
df2 = pd.DataFrame(datas, columns=['이름', '영어'])
df2

    이름   영어
0  길동이   50
1  길순이  100
2   유고   99
3  애슐리  100

In [105]:
# 컬럼정보 없으면 NaN으로 생성
df3 = pd.DataFrame(datas, columns=['이름', '음악'])
df3

    이름   음악
0  길동이  NaN
1  길순이  NaN
2   유고  NaN
3  애슐리  NaN

In [106]:
# 인덱스번호 추가
df4 = pd.DataFrame(data=datas, index=[x for x in range(1, len(datas))])
df4

    이름   국어   영어   수학   미술
1  길동이   80   50   90  100
2  길순이  100  100  100  100
3   유고   10   99   10   99
4  애슐리   90  100   50   30

##### 데이터프레임 내의 데이터 조회

In [107]:
df4['이름']

1    길동이
2    길순이
3     유고
4    애슐리
Name: 이름, dtype: object

In [108]:
df4['국어']

1     80
2    100
3     10
4     90
Name: 국어, dtype: int64

In [109]:
type(df4['이름'])

pandas.core.series.Series

In [110]:
df4[['이름', '국어']]

    이름   국어
1  길동이   80
2  길순이  100
3   유고   10
4  애슐리   90

In [111]:
type(df4[['이름', '국어']])

pandas.core.frame.DataFrame

In [112]:
# 레코드(row)형태 데이터 가지고온 것 (df4['국어']와 정반대)
df4.loc[1]

이름    길동이
국어     80
영어     50
수학     90
미술    100
Name: 1, dtype: object

In [113]:
type(df4.loc[1])

pandas.core.series.Series

In [114]:
# 다중인덱스
df4.loc[[1, 2, 3]]

    이름   국어   영어   수학   미술
1  길동이   80   50   90  100
2  길순이  100  100  100  100
3   유고   10   99   10   99

In [115]:
# 시스템 기본 인덱스값 으로 인덱싱
df4.iloc[0]

이름    길동이
국어     80
영어     50
수학     90
미술    100
Name: 1, dtype: object

In [116]:
## loc(), iloc() 차이를 보려면
df5 = pd.DataFrame(data=datas, index=['A', 'B', 'C', 'D'])
df5

    이름   국어   영어   수학   미술
A  길동이   80   50   90  100
B  길순이  100  100  100  100
C   유고   10   99   10   99
D  애슐리   90  100   50   30

In [117]:
df5.loc['A'] # 이렇게 우리가 추가한 인덱스로 찾아도 되고

이름    길동이
국어     80
영어     50
수학     90
미술    100
Name: A, dtype: object

In [118]:
df5.iloc[0] # 시스템에 기본 데이터프레임 인덱스로 찾아도 됨

이름    길동이
국어     80
영어     50
수학     90
미술    100
Name: A, dtype: object

In [119]:
df4.loc[[1,2,3]] # 내가 만든 인덱스로 loc

    이름   국어   영어   수학   미술
1  길동이   80   50   90  100
2  길순이  100  100  100  100
3   유고   10   99   10   99

In [120]:
df4.iloc[[0,1,2]] # 시스템 인덱스 iloc

    이름   국어   영어   수학   미술
1  길동이   80   50   90  100
2  길순이  100  100  100  100
3   유고   10   99   10   99

In [121]:
df4[0:3] # 인덱스 슬라이싱 == 리스트 슬라이싱

    이름   국어   영어   수학   미술
1  길동이   80   50   90  100
2  길순이  100  100  100  100
3   유고   10   99   10   99

##### 특정데이터 상세 조회

In [122]:
df5.loc['A', ['미술']]

미술    100
Name: A, dtype: object

In [123]:
# 최종 시리즈 확인
df4.iloc[1, [3]]

수학    100
Name: 2, dtype: object

In [124]:
# 최종 데이터만 확인
df4.iloc[1, 3]

100

In [125]:
# df4.iloc[1, 3] => numpy.int64 != int
type(int(df4.iloc[1, 3]))

int

##### 조건식 조회

In [126]:
df5

    이름   국어   영어   수학   미술
A  길동이   80   50   90  100
B  길순이  100  100  100  100
C   유고   10   99   10   99
D  애슐리   90  100   50   30

In [127]:
# 미술점수가 99점 초과한 학생
df5['미술'] > 99

A     True
B     True
C    False
D    False
Name: 미술, dtype: bool

In [128]:
# 미술점수가 99점 초과한 데이터프레임
df5[df5['미술'] > 99]

    이름   국어   영어   수학   미술
A  길동이   80   50   90  100
B  길순이  100  100  100  100

In [129]:
df5[df5['국어'] < 50]

   이름  국어  영어  수학  미술
C  유고  10  99  10  99

#### 조건식 계속

In [130]:
df5[(df5['국어'] >= 80) & (df5['수학'] >80 )]

    이름   국어   영어   수학   미술
A  길동이   80   50   90  100
B  길순이  100  100  100  100

In [131]:
# or 조건
df5[(df5['영어'] <= 50) | (df5['국어'] <= 10 )]

    이름  국어  영어  수학   미술
A  길동이  80  50  90  100
C   유고  10  99  10   99

In [132]:
# isin
df5[df5['영어'].isin([50, 99])]

    이름  국어  영어  수학   미술
A  길동이  80  50  90  100
C   유고  10  99  10   99

In [133]:
df5[(df5['영어'].isin([50, 99])) & (df5['수학'] == 10)]

   이름  국어  영어  수학  미술
C  유고  10  99  10  99

##### 데이터프레임 데이터 추가 / 변경 / 삭제

In [134]:
# 데이터 추가
df5['음악'] = [0, 100, 30, 70]
df5

    이름   국어   영어   수학   미술   음악
A  길동이   80   50   90  100    0
B  길순이  100  100  100  100  100
C   유고   10   99   10   99   30
D  애슐리   90  100   50   30   70

In [135]:
# 값 변경하여 추가
df5['음악 + 10'] = df5['음악'] + 10
df5

    이름   국어   영어   수학   미술   음악  음악 + 10
A  길동이   80   50   90  100    0       10
B  길순이  100  100  100  100  100      110
C   유고   10   99   10   99   30       40
D  애슐리   90  100   50   30   70       80

In [136]:
df5['음악'] = df5['음악'] + 10
df5

    이름   국어   영어   수학   미술   음악  음악 + 10
A  길동이   80   50   90  100   10       10
B  길순이  100  100  100  100  110      110
C   유고   10   99   10   99   40       40
D  애슐리   90  100   50   30   80       80

In [137]:
# 값변경
df5.loc[df5['음악'] > 100, ['음악']]=100
df5

    이름   국어   영어   수학   미술   음악  음악 + 10
A  길동이   80   50   90  100   10       10
B  길순이  100  100  100  100  100      110
C   유고   10   99   10   99   40       40
D  애슐리   90  100   50   30   80       80

In [138]:
# 특정위치 값만 변경
df5.at['A', '음악'] = 20
df5

    이름   국어   영어   수학   미술   음악  음악 + 10
A  길동이   80   50   90  100   20       10
B  길순이  100  100  100  100  100      110
C   유고   10   99   10   99   40       40
D  애슐리   90  100   50   30   80       80

In [139]:
# 삭제 - 음악 + 10
del df5['음악 + 10']
df5

    이름   국어   영어   수학   미술   음악
A  길동이   80   50   90  100   20
B  길순이  100  100  100  100  100
C   유고   10   99   10   99   40
D  애슐리   90  100   50   30   80

In [140]:
# drop , axis=0(values) axis=1(column)
df5.drop(['미술'], axis=1)

    이름   국어   영어   수학   음악
A  길동이   80   50   90   20
B  길순이  100  100  100  100
C   유고   10   99   10   40
D  애슐리   90  100   50   80

In [141]:
# 1row(values) 드랍
df5.drop('A', axis=0)

    이름   국어   영어   수학   미술   음악
B  길순이  100  100  100  100  100
C   유고   10   99   10   99   40
D  애슐리   90  100   50   30   80

In [60]:
# 실제로 지움 ==  del
df5.drop('C', axis=0, inplace=True)

KeyError: "['C'] not found in axis"

##### 나머지 속성값

In [143]:
df5.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [145]:
df5.values

array([['길동이', 80, 50, 90, 100, 20],
       ['길순이', 100, 100, 100, 100, 100],
       ['유고', 10, 99, 10, 99, 40],
       ['애슐리', 90, 100, 50, 30, 80]], dtype=object)

In [146]:
df5.shape #중요!!

(4, 6)

In [148]:
df5.size

24

In [149]:
df5.dtypes

이름    object
국어     int64
영어     int64
수학     int64
미술     int64
음악     int64
dtype: object

In [150]:
df5.T

      A    B   C    D
이름  길동이  길순이  유고  애슐리
국어   80  100  10   90
영어   50  100  99  100
수학   90  100  10   50
미술  100  100  99   30
음악   20  100  40   80